= 🐰 
//numberlessimage[newsletter202102]

== 概要

 * 技術書典10（2020/12/26~2021/1/6）への参加報告
 * 技術書典10で購入した本の紹介
 * DALL・E

== 技術書典10（2020/12/26~2021/1/6）への参加報告
今回は、前回出典した『ゼロからはじめるAI』(@<href>{https://techbookfest.org/product/6566174659706880})への追記をした本と、個人で趣味の本を出しました。どちらも無料で出しまして、『ゼロから～』のほうは400冊、趣味の本は80冊ほどダウンロードが出ました。Qiitaで無料本まとめの記事がたくさん見られていたようですので、そこから来てくださったかたがかなりいたのかもしれないです。もし私個人が電子書籍を作ってSNSに告知しただけであれば到底出ない数です。今回は年末年始の開催で出典者が前回より少なかったようですが、それでもイベントをチェックしている人の多さを感じました。
 


//numberlessimage[newsletter202102_1]
※技術書典9のときは毎晩夜中に作業していたので、作家気分を味わいました（？）。

『ゼロから～』に関しては前回20日程度で１冊を書き起こすというかなり無茶なスケジュールで大変でしたので、今回は2か月ほど前から内容を用意しており、比較的楽でした。前回ニューラルネットの説明といくつかのモデルのコード紹介をしたので、モデルの精度上げのテクニックについて追記しました。

 
//numberlessimage[newsletter20210218_2]

趣味の本のほうは、内容が趣味すぎて、技術書典に来るようなエンジニアの人には読まれないのではと思っていましたが、物珍しさもあったのか、意外と読んでいただけたようです。これを書く際、掲載する作品も同時に作らなくてはならなかったので結局イベント開始日に間に合わず、年もまたぎ、1/4にようやく出典できました。

デザインもレイアウトも自由なので楽しかったです。次回への反省点を記載しておきます。

=== 電子書籍作成反省点

 * iPhoneで撮った写真をそのままたくさん貼りつけたのでPDFが重くなってしまいました。事前にまとめてサイズを小さくしておくべきでした。
 * マンガやイラストなどの遊び要素をもっと入れたかったです。

自分でサークルを作って出典したので、そのことについて記録しておきます。

=== 超かんたん！サークル初出典手順

==== サークル結成

個人でも出典できるので、出ると決めた時点で結成完了です。

==== サークル申請

申請受付期間中に技術書典のサイトから申し込みをします。このとき、出典する本の概要と、サークルの活動内容が分かるサイトかSNSのリンクが必要です。私は趣味のサイトもSNSアカウントも何も持っていなかったので、Instagramのアカウントを作り、そこに作品を載せました。やっつけすぎて通らないのではないかと思いましたが、数日後に問題なく参加許可が出ました。ただ、次回からはlinktreeのリンクで申請しようと思います。linktreeはSNSなどのリンク先を1ページに表示するためのサービスで無料で利用できます。

==== 電子書籍作成：反省点は先のページに書きました。

PDF/EPUB/ZIPのいずれかで提出することになっているので前作同様、PowerPointで作りました。パワポ?!と思われるかもしれませんが、操作が簡単でレイアウトが自在だしある程度数式もかけるので、今の私にはこれで十分なんです。

PCで見ることを考慮し、画面上で見開きでみてほしいこの本は横長にしました。技術書典では縦長サイズが前提みたいで、書典に並んだときに横幅に合わせて表示サイズが少し小さくなりましたが、そのほかは問題ありませんでした。

==== 書籍申請

書籍ができたら、技術書典のサイトから申請します。ドラッグ＆ドロップで完了です。UIが分かりやすいので、特に迷うことはありませんでした。

翌日くらいにはOKが出て、作った本が書典に並んでいました。技術書典の運営さんががんばってチェックしてくださっているようです。本当にごくろうさまです。
技術書典の自分の本のページにはサンプル画像を上げられるようになっています。普通は目次や本の一部を載せるものですが、私は追加で、このページまで来てくれた人へのサンキューレターを載せていました。これを次回は毎日変えたいです。そのほうが絶対楽しいと思います。

==== 本紹介イベント参加

趣味本に関してはできあがったのが遅すぎて参加できなかったのですが、運営の方が本の紹介イベントを行っているので、次回は参加したいです。

書いたものをPDF出力できる仕組みさえあれば、それで電子書籍を作って参加することができるので、興味を持たれたかたは是非参加してみてください。
 


== 技術書典10で購入した本の紹介
===  『プリンをもっと見守る技術　M5StickVで始めるAIの世界』aNo研 著
(@<href>{https://techbookfest.org/product/5726575270035456})
//numberlessimage[newsletter202102_2]

カメラ+スピーカー+モニター+KPUが一口サイズの小さい機械に搭載されたM5StickVという機械があります。KPUが搭載されているので、AIのモデルを入れて顔認識などをさせることが可能です。
このM5StickVを使って冷蔵庫のプリンを食べてしまう犯人を検出しよう！　という趣旨で書かれた本です。こういうノリは好きです。書いてある手順通りやっていけばM5StickVでかなり遊べて楽しい本でした。

 
=== 『Jupyter BookでAIの解説本を書く方法』ZENKEI AI FORUM 中野裕 著
(@<href>{https://techbookfest.org/product/5840767786418176})
//numberlessimage[newsletter202102_3]

同じZENKEI AI FORUM のかたが書いた本です。

なんとこの本を書きながらJupyterBookについて学ばれたそうで、この本自体がJupyterBookでのサンプルとなっています。
 

== DALL・E
(@<href>{https://openai.com/blog/dall-e/})

//numberlessimage[newsletter202102_4]
an illustration of a baby daikon radish in a tutu walking a dog

※この記事内の絵はすべて私が描いたものです。DALL・Eの絵は上記リンクよりご確認ください。

OpenAI（人工知能を研究する非営利団体）が発表したAI「DALL・E」について。

DALL・Eは人間が入力した一連の言葉を絵に描いて出力するAIです。例えば「犬の散歩をしているチュチュを着た大根の赤ちゃんのイラスト（an illustration of a baby daikon radish in a tutu walking a dog）」と文章を入力すると、その通りを絵に描いたイラストが出力されるとのことです。“犬”や“大根”など一語から描くだけでもすごいと感じますが、複雑な文章も理解して描けるということです。出力例で見る限りでは、チュチュと大根がばらばらに並んでいたり、犬のほうがチュチュを着てしまったりということがないようなのです。大根の赤ちゃんには、ご丁寧にも赤ちゃんぽいかわいいお顔と犬の散歩のための手足が描かれています。説明によると、手足があって服を着ている大根の絵をあらかじめAIに学習させていたわけではなく、着衣の人間の絵を学習したことで、AIが大根の絵に“着衣”である状態を適用しているそうです。

実際に全文を入力してDALL・Eを試すことはできませんが、上記のURLのページの中ごろに黒枠で囲まれたところがありますので、その黒枠をクリックすると、テキストの一部を変更させた出力結果を見ることができます。

モデルについては、「文章と画像のペアのデータセットを使って、文章から画像を生成するよう訓練された120億パラメータのGPT-3」と説明されています。120億パラメータとはめちゃくちゃ多いですね！　一般のAIユーザにはちょっと手が出ない規模の機器が必要になりそうですが、出てきた絵のすばらしさを見れば納得ではあります。

//numberlessimage[newsletter20210218]
a stained glass window with an image of blue strawberry
このテキストでOpenAIが作成した画像はとてもかわいくて好きです。

=== 蛇足１
このパラメータ数を単純に生き物の神経細胞の数と比較するのはあまり意味のない行為ですが、一応調べてみました。wikipediaによると、大脳新皮質の神経細胞の平均数は、成人女性は190億、成人男性は230億、全身では1000億との推計がされています。人間の大脳新皮質の神経細胞の数は、ナガスクジラ（150億：体長20m～）やアフリカゾウ（110億：体長6m）よりも多く、ヒレナガゴンドウ（372億：体長6m、大脳の大きさは人間の2倍）よりも少ないということになります。
//numberlessimage[newsletter20210218_1]
a professional high quality illustration of a giraffe turtle chimera

=== 蛇足２
こうなってくると気になるのがヒレナガゴンドウって何？　ということです。ヒレナガゴンドウはイルカの一種で、北大西洋や南極の周りの海に生息しています。社会性が高く、つるんで行動する性質があるようです。おでこにメロンと呼ばれる脂肪体（エコーロケーションに使用すると推測されている）があるのと長い鎌形のヒレが特徴です。100個体ほどの群れを作り、肉食で、シャチにも勝つようです。寿命は、雄が45歳、雌が60歳ほどだそうです。
水中では敵なしで悪天候と人間以外は恐れるものはなく長生きとなると割と人生に余裕がありそうに思うのですが、退屈は感じないんでしょうか。イルカは、本を読まないし絵も描かないしアクセサリーを身に着けたりシールを集めたりもしないですよね。何して遊んでいるんだろう、、ある種のイルカはフグ毒を少量摂取してラリって遊ぶらしいですが、、いやそういう過激なんじゃなくて、、もっとカジュアルなのがないのかな、、いや遊びというもの自体が生存という観点からしたらやらなくていいことをやっているわけでそもそもちょっと危険なものなのか、、
動物ってなんであんなに群れで仲良くできるんだろう、生きていくためにはそうするしかないのかなと思っていました。しかし遊び道具がないならば、友達とだべって歌って踊っているのがいちばん手っ取り早く安全で楽しいのかもしれません。
 

ちなみに“イルカ　何をして遊ぶのか”で検索したら、“コロナ　遊び”と“大人　遊び”が他の検索案として出てきました。コロナは、、時代ですね、えっと、個人的にはこの機会に家事を覚えるのもいいんじゃないかと思います。マスク入れを自分で作ってみるとか。私はそもそもインドア派なのですが、この期間に家でできる遊びのレパートリーがまたふえました。例えばこんな感じです。

 * 炊飯器クッキング
炊飯器調理は調理は簡単だけど待ち時間のかかるものが多いですが、在宅勤務であれば無問題です。

 * AIクッキング
料理画像からレシピを生成するというAIモデルが存在しており、InverseCookingという名前で提供されています (@<href>{https://github.com/facebookresearch/inversecooking})。これを使えば、写真でしか見たことのない料理も自分で作ることができます。ただし、分量は出力されないため、味つけはカンで行う必要があり、料理をある程度知っている人向けと言えます。また、モデルは主に西洋料理を学んでいるようでアジア料理は解釈が間違って変なレシピになってしまうことがあります。そのギャップも楽しむものとして私は利用しています。この但し書きがドラえもんのひみつ道具っぽいですね。
 
 * オンラインダンスレッスン受講
YouTubeやInstagramで無料で配信されているかたもいます。ジャンプしない、集合住宅でもできるプログラムもたくさんあります。
私は正直、とりあえず体を動かせればよくて、これでダンスが踊れるようになるとは思っていなかったです。だって、“どうせオンラインだし” 受講者に合わせて細かいところまで教えられないでしょ。プログラミングならまだ画面を止めてコードを読んだりして各自のスピードで学習できるかもしれないけど、ダンスでは無理じゃない。もともとうまい人じゃないとオンラインでは学べないよね、と。ところが、私が受けているダンスの先生は、同じダンスに対して３種類の動画を出していたんです。音楽つきで通常スピードのもの、先生がゆっくり曲を口ずさみながらスローテンポでちょっと大げさに踊っているもの、一つ一つの動作を解説しているもの、すべて鏡になっていて、先生が動いたほうへ動けばいいようになっています。
先生は動画で「みんながどうやったらオンラインでダンス踊れるようになるか考えてこうしてみたんだけど、もしもっといい方法が見つかればまた変えます」と言っていて、まじめだなと私はおどろきました。そしてファッションがいつもおしゃれで、突然ヒョウ柄で出てきたりしてかわいいんです。“どうせこんなもんでしょ”っていう考え方は本当に間違ってるなあ、、やる人はなんでも工夫してやるもんだ、、と思いました。
@<br>{}

“大人　遊び”というのは、一つには、大人になったら友達と遊ぶとしたらお酒を飲みにいくばかりで子どものときみたいに鬼ごっこやトランプで盛り上がったりできない、何かいい遊びはないか、というちょっと切ない検索なのですね。大人だって鬼ごっこしてもいいんですが、このご時世集まれないというのと、そうでなくても仕事終わって夜八時とかに大人が全力で鬼ごっこできる場所ってあまりなさそうですよね。ほか、大人ならではの遊びとして、キャンプなんて素敵ですけど、毎晩は行きづらいですし。
うん、それなら、AIフォーラムに来たらいいじゃない、オンラインだし。というのは冗談として、サークルを作って、あるいは一人ででも、本を一冊書いてみるというのはいかがでしょうか。なんでも自分のしたいように作れますし、できたものを、会ったこともないどこかの誰かが読んでくれるというのは、独特な喜びがあります。

ではまた。電子の海でお会いしましょう。
//numberlessimage[newsletter20210218_3]
